作業目標:<br>
1. 敘述統計量計算<br>
2. 運用自定義函數apply

作業重點:<br>
1. 了解敘述統計量並解釋<br>
2. 運用apply時須注意自定義函數寫法

題目<br>
對以下成績資料做分析<br>
1. 6號學生(student_id=6)3科平均分數為何?<br>
2. 6號學生3科平均分數是否有贏過班上一半的同學?<br>
3. 由於班上同學成績不好，所以學校統一加分，加分方式為開根號乘以十，請問6號同學3科成績分別是?<br>
4. 承上題，加分後各科班平均變多少?
<br>
score_df = pd.DataFrame([[1,56,66,70], 
              [2,90,45,34],
              [3,45,32,55],
              [4,70,77,89],
              [5,56,80,70],
              [6,60,54,55],
              [7,45,70,79],
              [8,34,77,76],
              [9,25,87,60],
              [10,88,40,43]],columns=['student_id','math_score','english_score','chinese_score'])

In [78]:
import pandas as pd
import numpy as np
score_df = pd.DataFrame([[1,56,66,70], 
              [2,90,45,34],
              [3,45,32,55],
              [4,70,77,89],
              [5,56,80,70],
              [6,60,54,55],
              [7,45,70,79],
              [8,34,77,76],
              [9,25,87,60],
              [10,88,40,43]],columns=['student_id','math_score','english_score','chinese_score'])
score_df = score_df.set_index('student_id')
score_df

            math_score  english_score  chinese_score
student_id
1                   56             66             70
2                   90             45             34
3                   45             32             55
4                   70             77             89
5                   56             80             70
6                   60             54             55
7                   45             70             79
8                   34             77             76
9                   25             87             60
10                  88             40             43

In [70]:
#1.6號學生(student_id=6)3科平均分數為何?
score_df.iloc[5].mean()

56.333333333333336

In [71]:
#2. 6號學生3科平均分數是否有贏過班上一半的同學
score_df.mean(axis=1).median()
#沒贏過一半學生

59.833333333333336

In [72]:
#由於班上同學成績不好，所以學校統一加分，加分方式為開根號乘以十，請問6號同學3科成績分別是?

for i in range(len(score_df.columns)):
    for j in range(len(score_df.index)):
            score_df.iloc[j,i]=score_df.iloc[j,i]**(1/2)*10
                   
score_df

            math_score  english_score  chinese_score
student_id
1            74.833148      81.240384      83.666003
2            94.868330      67.082039      58.309519
3            67.082039      56.568542      74.161985
4            83.666003      87.749644      94.339811
5            74.833148      89.442719      83.666003
6            77.459667      73.484692      74.161985
7            67.082039      83.666003      88.881944
8            58.309519      87.749644      87.177979
9            50.000000      93.273791      77.459667
10           93.808315      63.245553      65.574385

In [74]:
score_df.iloc[5]

math_score       77.459667
english_score    73.484692
chinese_score    74.161985
Name: 6, dtype: float64

In [76]:
#承上題，加分後各科班平均變多少
score_df.mean()

math_score       74.194221
english_score    78.350301
chinese_score    78.739928
dtype: float64

In [ ]:
1. 根據題目給的 DataFrame 完成下列操作：
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False

In [105]:
data = {
    'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [106]:
#計算每個不同種類 animal 的 age 的平均數
for ani in set(df['animal']):
    age= df[df['animal']==ani]['age'].mean()
    print(ani,age)

snake 2.5
dog 5.0
cat 2.5

In [107]:
#將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
df = df.sort_values(by=['age','visits'])
df

  animal  age  visits priority
c  snake  0.5       2       no
f    cat  2.0       3       no
a    cat  2.5       1      yes
j    dog  3.0       1       no
b    cat  3.0       3      yes
g  snake  4.5       1       no
e    dog  5.0       2       no
i    dog  7.0       2       no
h    cat  NaN       1      yes
d    dog  NaN       3      yes

In [111]:
#將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
a = df['priority'] == 'yes'

df['priority'] = a
df

  animal  age  visits  priority
c  snake  0.5       2     False
f    cat  2.0       3     False
a    cat  2.5       1      True
j    dog  3.0       1     False
b    cat  3.0       3      True
g  snake  4.5       1     False
e    dog  5.0       2     False
i    dog  7.0       2     False
h    cat  NaN       1      True
d    dog  NaN       3      True

In [112]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
df

          0         1         2
0  0.239279  0.698402  0.048385
1  0.893721  0.113341  0.627274
2  0.612112  0.817644  0.241296
3  0.577346  0.012642  0.095956
4  0.416085  0.114366  0.252465

In [117]:
# -該欄位的平均數
df - df.mean()

          0         1         2
0 -0.308430  0.347123 -0.204690
1  0.346013 -0.237938  0.374199
2  0.064403  0.466365 -0.011779
3  0.029637 -0.338637 -0.157119
4 -0.131624 -0.236913 -0.000610

In [116]:
# -該筆資料平均數
df-df.mean(axis=1).mean()

          0         1         2
0 -0.144742  0.314381 -0.335636
1  0.509700 -0.270680  0.243253
2  0.228091  0.433623 -0.142725
3  0.193325 -0.371379 -0.288065
4  0.032064 -0.269655 -0.131556

In [118]:
df

          0         1         2
0  0.239279  0.698402  0.048385
1  0.893721  0.113341  0.627274
2  0.612112  0.817644  0.241296
3  0.577346  0.012642  0.095956
4  0.416085  0.114366  0.252465

In [126]:
#哪一比的資料總合最大
# .argmax返回最大值索引
df.sum().argmax()

0

In [127]:
# 哪一欄位的資料總合最小
df.sum().argmin()

2